In [1]:
# 3.0 Introduction
import pandas as pd

url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

dataframe = pd.read_csv(url)
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [ ]:
# 3.1 Creating a Dataframe

# create a dataframe
dictionary = {
    "Name" : ['Jacky Jackson', 'Steven Stevenson'] ,
    "Age" : [38 , 25],
    "Driver" : [True ,False]
}
# create a dataframe
dataframe = pd.DataFrame(dictionary)

# show dataframe
print(dataframe , "\n")

# add a column for a dataframe
dataframe["eyes"] = ["Brown", "Blue"]
print( dataframe)

# add a new feature 
# dictionary["weight"] = [80 , 70]
# dataframe = pd.DataFrame(dictionary)
# print(dataframe)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

               Name  Age  Driver   eyes
0     Jacky Jackson   38    True  Brown
1  Steven Stevenson   25   False   Blue
               Name  Age  Driver  weight
0     Jacky Jackson   38    True      80
1  Steven Stevenson   25   False      70

In [24]:
# 3.2 Getting Information about the Data

url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

dataframe = pd.read_csv(url)
print(dataframe.head(2) ,'\n')

# dataframe dimensions
print(dataframe.shape , '\n')

# Show statistics
print(dataframe.describe() , '\n')

print(dataframe.info())

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

(1313, 6)

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      1313 non-null   object
 1   PClass    1313 non-null   object
 2   Age       756 non-null    float64
 3   Sex       1313 non-null   object
 4   Survived  1313 non-null   int64
 5   SexCode   1313 non-null   int64
dtypes: float64(1), int64(2), object(3)
memory usage: 61.7+ KB
None

In [33]:
# 3.3 Slicing DataFrames
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

dataframe = pd.read_csv(url)

# select first row
print(dataframe.iloc[0] , '\n')

# select three rowa
print(dataframe.iloc[1:4] , '\n')

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

                                            Name PClass   Age     Sex  \
1                    Allison, Miss Helen Loraine    1st   2.0  female
2            Allison, Mr Hudson Joshua Creighton    1st  30.0    male
3  Allison, Mrs Hudson JC (Bessie Waldo Daniels)    1st  25.0  female

   Survived  SexCode
1         0        1
2         0        0
3         0        1

In [34]:
# select 4 rows
dataframe.iloc[:4]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [37]:
# set index and select row using index
dataframe = dataframe.set_index(dataframe['Name'])

# show row
# loc is useful when the index of the dataframe is a label
dataframe.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

In [41]:
# 3.4 Selecting Rows Based on Conditionals
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

dataframe = pd.read_csv(url)

# show top two rows when type sex is female
dataframe[dataframe['Sex'] == 'female'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [43]:
# filter rows
dataframe[(dataframe["Sex"] == 'female') & (dataframe['Age'] >= 65)]

,Name,PClass,Age,Sex,Survived,SexCode
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

In [ ]:
# 3.5 Sorting Values
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

dataframe = pd.read_csv(url)

# Sort the dataframe by age ascending, show two rows
dataframe.sort_values(by=['Age']).head(2)

,Name,PClass,Age,Sex,Survived,SexCode
763,"Dean, Miss Elizabeth Gladys (Millvena)",3rd,0.17,female,1,1
751,"Danbom, Master Gilbert Sigvard Emanuel",3rd,0.33,male,0,0

In [ ]:
# Sort the dataframe by age descending, show two rows
dataframe.sort_values(by=['Age'] , ascending=False).head(2)

                           Name PClass   Age   Sex  Survived  SexCode
505  Mitchell, Mr Henry Michael    2nd  71.0  male         0        0
119    Goldschmidt, Mr George B    1st  71.0  male         0        0

In [48]:
# 3.6 Replacing Values
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

dataframe = pd.read_csv(url)

# Replace values, show two rows
dataframe['Sex'].replace("female" , "Woman").head(2)

0    Woman
1    Woman
Name: Sex, dtype: object

In [51]:
# Replace "female" and "male" with "Woman" and "Man"
dataframe["Sex"].replace(["female" , "male"] , ["Woman" , "Man"]).head(5)

0    Woman
1    Woman
2      Man
3    Woman
4      Man
Name: Sex, dtype: object

In [53]:
# replace values 
dataframe.replace(1 , "one").head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,one,one
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,one
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,one
4,"Allison, Master Hudson Trevor",1st,0.92,male,one,0

In [56]:
# replace values
# r and regex means that every pattern in data similar to "1st" 
# will replace with "First" , ex: 1stPlace -> FirstPlace
dataframe.replace(r"1st" , "First" , regex=True).head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",First,29.00,female,1,1
1,"Allison, Miss Helen Loraine",First,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",First,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",First,25.00,female,0,1
4,"Allison, Master Hudson Trevor",First,0.92,male,1,0

In [61]:
# 3.7 Renaming Columns
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

dataframe = pd.read_csv(url)

# rename sex column in format of a dict
dataframe.rename(columns={"PClass" : "Passenger Class"}).head(2)

,Name,Passenger Class,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [63]:
# rename columns
dataframe.rename(columns={"PClass" : "Passenger Class" , "Sex" : "Gender"}).head(2)

,Name,Passenger Class,Age,Gender,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [67]:
import collections

# create a dictionary
column_names = collections.defaultdict(str)

# create keys
for name in dataframe.columns:
    column_names[name]
    
# show dictionary
column_names

defaultdict(str,
            {'Name': '',
             'PClass': '',
             'Age': '',
             'Sex': '',
             'Survived': '',
             'SexCode': ''})

In [76]:
# 3.8 Finding the Minimum, Maximum, Sum, Average, and Count

url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

dataframe = pd.read_csv(url)

print('Maximum: ', dataframe['Age'].max())
print('Minimum: ', dataframe['Age'].min())
print('Mean: ', dataframe['Age'].mean())
print('Sum: ', dataframe['Age'].sum())
print('Count: ', dataframe['Age'].count())
print('Std: ', dataframe['Age'].std())
print('Skewness: ', dataframe['Age'].skew())
print('Mode: ', dataframe['Age'].mode())

# show counts
dataframe.count()

Maximum:  71.0
Minimum:  0.17
Mean:  30.397989417989418
Sum:  22980.88
Count:  756
Std:  14.259048710359018
Skewness:  0.36851087371648295
Mode:  0    22.0
Name: Age, dtype: float64

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

In [72]:
# 3.9 Finding Unique Values

url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

dataframe = pd.read_csv(url)

# show unique values
dataframe['Sex'].unique()

array(['female', 'male'], dtype=object)

In [73]:
dataframe['PClass'].unique()

array(['1st', '2nd', '*', '3rd'], dtype=object)

In [77]:
dataframe['Sex'].value_counts()

Sex
male      851
female    462
Name: count, dtype: int64

In [78]:
dataframe['PClass'].value_counts()

PClass
3rd    711
1st    322
2nd    279
*        1
Name: count, dtype: int64

In [79]:
# show number of unique values
dataframe['PClass'].nunique()

4

In [83]:
# 3.10 Handling Missing Values
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

dataframe = pd.read_csv(url)

# Select missing values, show two rows
dataframe[dataframe['Age'].isnull()].head(2)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0

In [84]:
# Attempt to replace values with NaN
dataframe['Sex'] = dataframe['Sex'].replace(Nan , "male")

NameError: name 'Nan' is not defined

In [96]:
import numpy as np

# replace values with NaN ( not a number )
dataframe['Sex'] = dataframe['Sex'].replace("male" , np.nan)

# load data, set missing values
dataframe = pd.read_csv(url , na_values=[np.nan , 'NONE',-999])

# Get a single null row
# null_entry = dataframe[dataframe['Age'].isnull()].head(1)
null_entry = dataframe[dataframe['Age'].isna()].head(1)
print(null_entry)
print("------------------------------------------------------------")
# Fill all null values with the mean age of passengers
null_entry.fillna(dataframe['Age'].mean())

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
------------------------------------------------------------

                            Name PClass        Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  30.397989  female         1        1